## Plan Result (sbox_frontdoor - TerraformPlanApply)




<pre><code>Plan: 18 to add, 11 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;portal-sbox&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-test-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["darts-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/darts-portal"
        name                            = "darts-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pip-frontend"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/ruleSets/pipfrontendcaching",
        ] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/pip-frontend"
        name                            = "pip-frontend"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["portal-sbox"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/portal-sbox"
        name                            = "portal-sbox"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["pre-portal"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/pre-portal"
        name                            = "pre-portal"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/sds-api-mgmt"
        name                            = "sds-api-mgmt"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["toffee"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [
          - "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/ruleSets/toffeecaching",
        ] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/toffee"
        name                            = "toffee"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/vh-admin-web"
        name                            = "vh-admin-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-test-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/vh-test-web"
        name                            = "vh-test-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["vh-video-web"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      ~ cdn_frontdoor_rule_set_ids      = [] -> (known after apply)
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox/afdEndpoints/sdshmcts-sbox/routes/vh-video-web"
        name                            = "vh-video-web"
        # (11 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "dartsportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "pipfrontendHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["portal-sbox"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "portalsboxHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "preportalHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sdsapimgmtHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "toffeeHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhadminwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhtestwebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule.hsts_header["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule" "hsts_header" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "vhvideowebHstsHeader"
      + order                       = 1

      + actions {
          + response_header_action {
              + header_action = "Overwrite"
              + header_name   = "Strict-Transport-Security"
              + value         = "max-age=31536000; includeSubDomains"
            }
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["darts-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "dartsportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pip-frontend"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "pipfrontendHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["portal-sbox"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "portalsboxHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["pre-portal"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "preportalHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["sds-api-mgmt"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "sdsapimgmtHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["toffee"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "toffeeHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-admin-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "vhadminwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-test-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "vhtestwebHstsRule"
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_rule_set.hsts_rules["vh-video-web"] will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "hsts_rules" {
      + cdn_frontdoor_profile_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox"
      + id                       = (known after apply)
      + name                     = "vhvideowebHstsRule"
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.toffee"
        name                = "_dnsauth.toffee"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_hru2od60mfhcb9ru4vxi5mn6raq6atd" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/lz-sbox-rg/providers/Microsoft.Cdn/profiles/sdshmcts-sbox|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 18 to add, 11 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":918,"Program":"tfcmt","SHA1":"","Target":"sbox_frontdoor - TerraformPlanApply","Vars":{}} -->